Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФактическомуИспользованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортСырьевыхТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортНесырьевыхТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОСВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяРаспределением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДСУПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСДЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияРаботУслугНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаПоПатенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеверсивноеОбложениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДССМежценовойРазницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Космос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяНДСВСтранеЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛьготноеНалогообложениеНДСНаУСН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РеализацияПодарочныхСертификатовЛокализация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив Из Строка - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	//++ Локализация


	//-- Локализация
	
КонецПроцедуры

// Процедура дополняет тексты запросов проведения документа.
//
// Параметры:
//  Запрос - Запрос - Общий запрос проведения документа.
//  ТекстыЗапроса - СписокЗначений Из Строка - Список текстов запроса проведения.
//  Регистры - Строка, Структура - Список регистров проведения документа через запятую или в ключах структуры.
//
Процедура ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	//++ Локализация


	//-- Локализация
	
КонецПроцедуры



#КонецОбласти

#Область Фискализация

//++ Локализация

// Определяет систему налогообложения по документу
// 
// Параметры:
// 	ДокументСсылка - ДокументСсылка - Документ для определения системы налогообложения
// Возвращаемое значение:
// 	ПеречислениеСсылка.ТипыСистемНалогообложенияККТ - Система налогообложения по документу
Функция СистемаНалогообложенияПоДокументу(ДокументСсылка) Экспорт
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Организация, КассаККМ");
	РеквизитыКассыККМ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыДокумента.КассаККМ, "Склад, Подразделение");
	
	НалогообложениеНДС = УчетНДСУП.ПараметрыУчетаПоОрганизации(РеквизитыДокумента.Организация, ТекущаяДатаСеанса(), РеквизитыКассыККМ.Склад, РеквизитыКассыККМ.Подразделение).НалогообложениеНДСРозничнойПродажи;
	
	Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД Тогда
		СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД;
	ИначеЕсли НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаПоПатенту Тогда
		СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.Патент;
	Иначе
		СистемаНалогообложения = РозничныеПродажиЛокализация.СистемаНалогообложенияФискальнойОперации(РеквизитыДокумента.Организация);
	КонецЕсли;
	
	Возврат СистемаНалогообложения;
	
КонецФункции

// Получить основные данные по таблице товаров для чека о розничной продаже
//
// Параметры:
//  ДокументСсылка - ДокументОбъект.РеализацияПодарочныхСертификатов - Документ.
//  ЧекКоррекцииИсправленииОшибки - Булево - Это чек коррекции "Исправление ошибки"
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные о продажах:
//  * НомерСтроки - Число -
//  * Номенклатура - Строка -
//  * Характеристика - Строка - 
//  * ТипНоменклатуры - Неопределено - 
//  * ПодакцизныйТовар - Булево - 
//  * НоменклатураНаименование - Строка - 
//  * ХарактеристикаНаименование - Строка - 
//  * Упаковка - Строка - 
//  * УпаковкаНаименование - Строка - 
//  * Количество - Число - 
//  * КоличествоУпаковок - Число - 
//  * Цена - Число - 
//  * СуммаСНДС - Число - 
//  * СтавкаНДС - СправочникСсылка.СтавкиНДС - 
//  * СуммаНДС - Число - 
//  * СуммаСкидки - Число - 
Функция ПредметыРасчетовПоДокументу(ДокументСсылка, ЧекКоррекцииИсправленииОшибки = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДокументСсылка,
		"Дата, Организация, НалогообложениеНДС");
		
	СтавкаНДС = УчетНДСУП.СтавкаНДСПоНоменклатуреИНалогообложению(
		Неопределено,
		РеквизитыДокумента.НалогообложениеНДС,
		РеквизитыДокумента.Организация,
		РеквизитыДокумента.Дата);
	
	СтавкаНДСЧислом = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтавкаНДС, "Ставка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодарочныеСертификаты.НомерСтроки,
	|	ПодарочныеСертификаты.ПодарочныйСертификат.Наименование КАК Номенклатура,
	|	""""                                             		КАК Характеристика,
	|	""""                                             		КАК Упаковка,
	|
	|	1 														КАК Количество,
	|	1 														КАК КоличествоУпаковок,
	|
	|	ПодарочныеСертификаты.Сумма 							КАК Цена,
	|	ПодарочныеСертификаты.Сумма								КАК СуммаСНДС,
	|
	|	ВЫБОР
	|		КОГДА &НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаПоПатенту))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
	|		ИНАЧЕ &СтавкаНДС
	|	КОНЕЦ 													КАК СтавкаНДС,
	|
	|	ВЫБОР
	|		КОГДА &НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаПоПатенту))
	|			ИЛИ &СтавкаНДСЧислом = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ПодарочныеСертификаты.Сумма / (100 + &СтавкаНДСЧислом) * &СтавкаНДСЧислом КАК ЧИСЛО(31,2))
	|	КОНЕЦ 													КАК СуммаНДС,
	|	
	|	0														КАК СуммаСкидки
	|	
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	Документ.РеализацияПодарочныхСертификатов.ПодарочныеСертификаты КАК ПодарочныеСертификаты
	|ГДЕ
	|	ПодарочныеСертификаты.Ссылка = &Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки,
	|	Товары.Номенклатура,
	|
	|	НЕОПРЕДЕЛЕНО					КАК ТипНоменклатуры,
	|	ЛОЖЬ							КАК ПодакцизныйТовар,
	|	
	|	Товары.Номенклатура   			КАК НоменклатураНаименование,
	|	Товары.Характеристика 			КАК ХарактеристикаНаименование,
	|	Товары.Упаковка					КАК УпаковкаНаименование,
	|	
	|	Товары.Характеристика,
	|	Товары.Упаковка,
	|	Товары.Количество,
	|	Товары.КоличествоУпаковок,
	|	Товары.Цена,
	|	Товары.СуммаСНДС,
	|	Товары.СтавкаНДС,
	|	Товары.СуммаНДС,
	|	Товары.СуммаСкидки
	|ИЗ
	|	ТаблицаТовары КАК Товары
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки
	|";
	Запрос.УстановитьПараметр("Ссылка"            , ДокументСсылка);
	Запрос.УстановитьПараметр("НалогообложениеНДС", РеквизитыДокумента.НалогообложениеНДС);
	Запрос.УстановитьПараметр("СтавкаНДС"         , СтавкаНДС);
	Запрос.УстановитьПараметр("СтавкаНДСЧислом"   , СтавкаНДСЧислом);
	
	ПредметыРасчетов = Запрос.Выполнить().Выгрузить();
	
	Возврат ПредметыРасчетов;
	
КонецФункции

//-- Локализация

// Определяет и возвращает статус, является ли организации плательщиком НДС
// 
// Параметры:
// 	Организация - СправочникСсылка.Организации - Организация, по которой определяется, облагается ли она НДС
// 	ОрганизацияПлательщикНДС - Булево - Параметр для сохранения и передачи во вне значения
Процедура ОбновитьОрганизацияПлательщикНДС(Организация, ОрганизацияПлательщикНДС) Экспорт
	
	//++ Локализация
	ОрганизацияПлательщикНДС = УчетнаяПолитика.ПлательщикНДС(Организация, ТекущаяДатаСеанса())
		И НЕ УчетнаяПолитика.ПрименяетсяОсвобождениеОтУплатыНДС(Организация, ТекущаяДатаСеанса());
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
